#+TITLE: Pathfinder Character Sheet
#+AUTHOR: Jesus Ramos

# Just fill in the relevant information in the tables and recalculate all tables
# if necessary
# M-x org-table-recalculate-buffer-tables

* Basic Character Info
  - Name :: Tsardok
  - Race :: Half-Orc
  - Gender :: Male
  - Height :: 6ft
  - Weight :: 172lbs
  - Age :: 25
  - Alignment :: Lawful Good
  - Deity :: Shelyn
  - Background Occupation :: Being awesome
  - Languages :: Common, Orc

  #+NAME:Size
  |------------|
  | Size Bonus |
  |------------|
  |          0 |
  |------------|

* Character Stats
  #+NAME:Stats
  |---+--------------+-------+----------+------+----------+---------+------|
  | ! | Stat         | Total | Modifier | Base | Inherent | Enhance | Misc |
  |---+--------------+-------+----------+------+----------+---------+------|
  | # | Strength     |    17 |        3 |   14 |        3 |         |      |
  | # | Dexterity    |    10 |        0 |   10 |          |         |      |
  | # | Constitution |    14 |        2 |   14 |          |         |      |
  | # | Intelligence |    10 |        0 |   10 |          |         |      |
  | # | Wisdom       |    10 |        0 |   10 |          |         |      |
  | # | Charisma     |    14 |        2 |   14 |          |         |      |
  |---+--------------+-------+----------+------+----------+---------+------|
  #+TBLFM: @2$3..@2$3=vsum($5..$8)::@2$4..@7$4=floor(($3 - 10) / 2)

* Class
  # Just hit TAB on the last row to recalculate when adding a new class
  #+NAME:Class
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  | ! |     HP | HD  | Class Name    | BAB | Skills | Fort | Ref | Will | Levels |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  |   |     49 | d10 | Paladin       |   5 |     10 |    4 |   1 |    4 |      5 |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  |   | Totals |     | Favored Class |     |        |      |     |      |        |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  | # |     49 |     | Paladin       |   5 |     10 |    4 |   1 |    4 |      5 |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  #+TBLFM: @>$2=vsum(@2..@-2)::@>$5..@>$10=vsum(@2..@-2)

* Defense
  #+NAME:Saves
  |---+---------------+-------+------+---------+---------+------|
  | ! | Saving Throws | Total | Base | Ability | Enhance | Misc |
  |---+---------------+-------+------+---------+---------+------|
  | # | Fortitude     |     9 |    4 |       2 |       3 |      |
  | # | Reflex        |     7 |    1 |       0 |       3 |    3 |
  | # | Will          |     7 |    4 |       0 |       3 |      |
  |---+---------------+-------+------+---------+---------+------|
  #+TBLFM: $5=remote(Stats,@3$Modifier)::@2$3..@4$3=vsum($4..$7)::@2$4=remote(Class, @>$Fort)::@2$5=remote(Stats, @4$Modifier)::@3$4=remote(Class, @>$Ref)::@4$4=remote(Class, @>$Will)::@4$5=remote(Stats, @6$Modifier)

  #+NAME:CMD
  |---+-----+-------+------+-----+-----+-----+------+------|
  | ! |     | Total | Base | BAB | Dex | Str | Size | Misc |
  |---+-----+-------+------+-----+-----+-----+------+------|
  | # | CMD |    18 |   10 |   5 |   0 |   3 |    0 |      |
  |---+-----+-------+------+-----+-----+-----+------+------|
  #+TBLFM: @2$3=vsum($4..$9)::@2$5=remote(Class, @>$BAB)::@2$6=remote(Stats, @3$Modifier)::@2$7=remote(Stats, @2$Modifier)::@2$8=remote(Size, @2$1)

  #+NAME:HP
  |---+--------------+----|
  | # | Base         | 49 |
  |   | Temporary HP |    |
  |---+--------------+----|
  | # | Total        | 49 |
  |---+--------------+----|
  #+TBLFM: @1$3=remote(Class, @2$HP)::@3$3=@1$3+@2$3

  #+NAME:AC
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  | ! | Type      | Total | Base | Armor | Shield | Dex | Size | Dodge | Natural | Deflect | Misc |
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  | # | AC        |    22 |   10 |     8 |      2 |   0 |    0 |       |       1 |       1 |      |
  | # | Touch     |    11 |   10 |   N/A |    N/A |   0 |    0 |       |     N/A |       1 |      |
  | # | Flat-foot |    20 |   10 |     8 |      0 | N/A |    0 | N/A   |       1 |       1 |      |
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  #+TBLFM: @2$3..@>$3=vsum($4..$12);N::@2$5=remote(Armor, @2$AC)::@2$6=remote(Armor, @3$AC)::@2$7..@3$7=min(remote(Stats, @3$Modifier), remote(Armor, @>$6)::@2$8..@>$8=remote(Size, @2$1)::@4$5=remote(Armor, @2$AC)

* Attacks
  #+NAME:Attacks
  |---+--------+-------+-------------------+---------+------+------|
  | ! |        | Total | Base Attack Bonus | Ability | Size | Misc |
  |---+--------+-------+-------------------+---------+------+------|
  | # | Melee  |     8 |                 5 |       3 |    0 |      |
  | # | Ranged |     5 |                 5 |       0 |    0 |      |
  | # | CMB    |     8 |                 5 |       3 |    0 |      |
  |---+--------+-------+-------------------+---------+------+------|
  #+TBLFM: @2$3..@4$3=vsum($4..$7)::@2$4..@4$4=remote(Class, @>$BAB)::@2$5=remote(Stats, @2$Modifier)::@2$6=remote(Size, @2$1)::@3$5=remote(Stats, @3$Modifier)::@3$6=remote(Size, @2$1)::@4$5=remote(Stats, @2$Modifier)::@4$6=remote(Size, @2$1)

* Skills
  # To mark as a class skill just put a 1 in the class column, org mode doesn't
  # support checkboxes in tables yet. You can add or change the ability the
  # stat depends on by modifying the Stat column. If a skill is affected by
  # armor penalty just mark it with a 1 in the Armor Penalty column
  #+NAME:Skills
  |---+---------------+-------+---------------------+------+-------+-------+---------+---------+------|
  | ! | Armor Penalty | Class | Skill               | Stat | Total | Ranks | Ability | Trained | Misc |
  |---+---------------+-------+---------------------+------+-------+-------+---------+---------+------|
  | # |             1 |       | Acrobatics          | Dex  |    -8 |       |       0 |         |      |
  | # |               |       | Appraise            | Int  |     0 |       |       0 |         |      |
  | # |               |       | Bluff               | Cha  |     2 |       |       2 |         |      |
  | # |             1 |       | Climb               | Str  |    -5 |       |       3 |         |      |
  | # |               |     1 | Craft:              | Int  |     0 |       |       0 |         |      |
  | # |               |       | Craft:              | Int  |     0 |       |       0 |         |      |
  | # |               |     1 | Diplomacy           | Cha  |    10 |     5 |       2 |       3 |      |
  | # |             1 |       | Disable Device      | Dex  |    -8 |       |       0 |         |      |
  | # |               |       | Disguise            | Cha  |     2 |       |       2 |         |      |
  | # |             1 |       | Escape Artist       | Dex  |    -8 |       |       0 |         |      |
  | # |             1 |       | Fly                 | Dex  |    -8 |       |       0 |         |      |
  | # |               |     1 | Handle Animal       | Cha  |     8 |     3 |       2 |       3 |      |
  | # |               |     1 | Heal                | Wis  |     0 |       |       0 |         |      |
  | # |               |       | Intimidate          | Cha  |     4 |       |       2 |         |    2 |
  | # |               |     1 | Knowledge: Nobility | Int  |     4 |     1 |       0 |       3 |      |
  | # |               |     1 | Knowledge: Religion | Int  |     4 |     1 |       0 |       3 |      |
  | # |               |       | Linguistics         | Int  |     0 |       |       0 |         |      |
  | # |               |       | Perception          | Wis  |     0 |       |       0 |         |      |
  | # |               |       | Perform:            | Cha  |     2 |       |       2 |         |      |
  | # |               |     1 | Profession:         | Wis  |     0 |       |       0 |         |      |
  | # |             1 |     1 | Ride                | Dex  |    -8 |       |       0 |         |      |
  | # |               |     1 | Sense Motive        | Wis  |     0 |       |       0 |         |      |
  | # |             1 |       | Sleight of Hand     | Dex  |    -8 |       |       0 |         |      |
  | # |               |     1 | Spellcraft          | Int  |     0 |       |       0 |         |      |
  | # |             1 |       | Stealth             | Dex  |    -8 |       |       0 |         |      |
  | # |               |       | Survival            | Wis  |     0 |       |       0 |         |      |
  | # |             1 |       | Swim                | Str  |    -5 |       |       3 |         |      |
  | # |               |       | Use Magic Device    | Cha  |     2 |       |       2 |         |      |
  |---+---------------+-------+---------------------+------+-------+-------+---------+---------+------|
  #+TBLFM: @2$6..@>$6=vsum($7..$10)+($2*remote(Armor, @>$Penalty))::@2$8..@>$8='(cond ((string= $5 "Str") remote(Stats, @2$Modifier)) ((string= $5 "Dex") remote(Stats, @3$Modifier)) ((string= $5 "Int") remote(Stats, @5$Modifier)) ((string= $5 "Wis") remote(Stats, @6$Modifier)) ((string= $5 "Cha") remote(Stats, @7$Modifier)))::@2$9..@>$9=if($3 > 0 && $7 > 0, 3, string(""))

* Inventory

** Equipment
   # Just add new rows for new items
   #+NAME:Equipment
   |---+----------+------+---------------|
   | ! | Quantity | Name | Weight        |
   |---+----------+------+---------------|
   |   |          |      |               |
   |---+----------+------+---------------|
   |   |          |      | Total Weight: |
   |---+----------+------+---------------|
   | # |          |      | 0             |
   |---+----------+------+---------------|
   #+TBLFM: @4$4=vsum(@2$4..@-2$4)

   # Worn magic items
   #+NAME:WornEquipment
   |-----------+---|
   | Head      |   |
   | Face      |   |
   | Throat    |   |
   | Shoulders |   |
   | Body      |   |
   | Torso     |   |
   | Arms      |   |
   | Hands     |   |
   | Ring      |   |
   | Ring      |   |
   | Waist     |   |
   | Feet      |   |
   |-----------+---|

   #+NAME:Armor
   |---+---------+------------------------+---------+----+---------+---------+----------------+------+------+----------|
   | ! |         | Name                   | Enhance | AC | Max Dex | Penalty | Spell Fail (%) | Type | Size | Material |
   |---+---------+------------------------+---------+----+---------+---------+----------------+------+------+----------|
   |   | Armor   | Half-Plate             |         |  8 |       0 |      -7 |             40 |      | M    |          |
   |   | Shield  | Masterwork Heavy Steel |         |  2 |         |      -1 |             15 |      | M    |          |
   |---+---------+------------------------+---------+----+---------+---------+----------------+------+------+----------|
   | # | Totals: |                        |         | 10 |       0 |      -8 |             55 |      |      |          |
   |---+---------+------------------------+---------+----+---------+---------+----------------+------+------+----------|
   #+TBLFM: @4$5=vsum(@2$5..@-1$5)::@4$6=@2$6::@4$7=vsum(@2$7..@-1$7)::@4$8=vsum(@2$8..@-1$8)

** Magic Items

** Wealth
   #+NAME:Wealth
   |----------+---|
   | Platinum |   |
   | Gold     |   |
   | Silver   |   |
   | Copper   |   |
   |----------+---|

** Bags and Containers
   #+NAME:Bags
   |-----------+--------+--------|
   | Container | Volume | Weight |
   |-----------+--------+--------|
   |           |        |        |
   |-----------+--------+--------|

* Spells

* Notes
